---
kind: type
id: T:Autodesk.Revit.DB.ParameterSet
source: html/6e6e8667-ebe2-0c60-c180-9d8000cff598.htm
---
# Autodesk.Revit.DB.ParameterSet

A set that contains parameters.

## Syntax (C#)
```csharp
public class ParameterSet : APIObject,
	IEnumerable
```